{
    "version": "https://jsonfeed.org/version/1",
    "title": "HiskiH&#x27;s Blog",
    "description": "",
    "home_page_url": "https://blog.hiskih.fi",
    "feed_url": "https://blog.hiskih.fi/feed.json",
    "user_comment": "",
    "icon": "https://blog.hiskih.fi/media/website/chess-rook.png",
    "author": {
        "name": "HiskiH"
    },
    "items": [
        {
            "id": "https://blog.hiskih.fi/feeling-and-thought-osr-procedures-are-pbta-moves.html",
            "url": "https://blog.hiskih.fi/feeling-and-thought-osr-procedures-are-pbta-moves.html",
            "title": "Feeling &amp; Thought: OSR procedures are PbtA moves?",
            "summary": "You read the title. After doing some heavy research into various OSR&hellip;",
            "content_html": "<p>You read the title. After doing some heavy research into various OSR games as well as reading both Apocalypse World and Masks: A New Generation I had a thought: how far are OSR procedures from PbtA moves?</p>\n<pre><em>This is a Feeling &amp; Thought. A series where I write about my experiences in the TTRPG hobby. Just like feelings, these thoughts aren't science, they aren't truth, and they definitely aren't reliable. Explore them with a playful attitude and don't take them too seriously. I certainly don't.<br></em></pre>\n<p>Credit where credit is due, this whole thought is based on discussion we had over at the NSR Cauldron. Prompted by a question of transitioning from PbtA games to OSR games, a debate was held on the similarities of these two playstyles. Of course these two styles differ in their approach to story: PbtA maximizing the narrative impact and flow whereas OSR almost nihilistically disregards storytelling. The priorities at the table could not be more diametrically opposed. Yet, when looking at the tools these games use, they suddenly are not that far apart.</p>\n<h5>Minimal Rules</h5>\n<p>Both styles aim to be extremely simple to run and reduce the amount of rules a player needs to remember.</p>\n<h5>Roll when necessary</h5>\n<p>Both styles are very particular about when to roll dice. OSR to resolve conflict and PbtA to resolve a situation when a move is triggered.</p>\n<h5>Proceduralism</h5>\n<p>While the more minimal OSR games avoid heavy procedure, more recent games like Errant are quite thick with various systems to keep the game running. PbtA games are quite similar with extensive and complex move descriptions with elaborate outcomes.</p>\n<p>A big point of contention in the discussion was about the idea of looking for solutions on your character sheet. This is a gameplay ideal OSR often uses to differentiate itself from modern D&amp;D and its ilk: OSR games want you to solve problems in fiction, wheras games with more elaborate character sheets and abilities often result in players looking for spells and abilities from their character. Initially I argued using the points mentioned above that PbtA runs similar to OSR, with a series of moves that explain the procedure for particular actions. However...</p>\n<hr>\n<p>Vincent Baker, the author of Apocalypse World, the A in PbtA, appeared carrying great insight! Which did sway me to change my view slightly. The following are a few quotes from Vincent, posted with permission, and my thoughts on them:</p>\n<blockquote>\n<p>If you think of AW as kind of a contract between the players (inc the GM), the moves are things that the players are entitled to. When I have my character read a situation, for instance, I'm entitled to roll+Sharp and ask a couple of questions.</p>\n</blockquote>\n<p>Very clearly the players are expected to use the tools in their arsenal. Obviously OSR games also grant you tools to use but not at this scale. Push-button-on-sheet confirmed?</p>\n<blockquote>\n<p>I don't think of them [moves] as solutions, in Apocalypse World's case. Many of the moves, most of the time, don't solve problems, they clarify and/or escalate them.</p>\n</blockquote>\n<p>This is where it gets interesting. The main issue OSR players have with the modern D&amp;D style is that quite often players will see a problem and ask to make something like an <em>Intelligence Check </em>to get a solution or cast a spell (that can't fail by the way) to make something happen. The moves in Apocalypse World don't exactly work this way, instead they direct the flow of action towards an outcome. Vincent wrapped up this line of thought nicely:</p>\n<blockquote>\n<p>If the GM's job is to give you problems, then yeah, sometimes your moves will give you solutions to them, and that can be pretty dissatisfying. But if the GM's job is to give you interesting situations to make decisions about, you'll never find your decision in your moves, your moves just give you different options to consider. This is Apocalypse World's model. I can't speak for other PbtA games!</p>\n</blockquote>\n<hr>\n<p>Where does this lead? Obviously the styles of play are different, but how exactly? My aswer is this: Both OSR and PbtA style games can be procedure heavy, but where PbtA wants you to use its procedure (moves) actively, OSR games use procedures to speed players along to the point, which is problem solving in fiction. Even a procedure heavy OSR game doesn't want you to play through procedure unless necessary. For PbtA the moves are the gameplay.</p>\n<p>Another question I pondered is how much the problems these styles of play present  influences the amount of procedure used. If a character from Apocalypse World entered an OSR style dungeon I think they would not use most of their moves to solve their problems. The majority of moves are to direct stories between characters, as opposed to characters and their environment. If social situations were more prevalent in OSR games, would we have more active procedures to resolve them?</p>\n<p>So all in all, to no-one's surprise, the games and styles share some common dna but have major differences. Vincent confirmed this as well:</p>\n<blockquote>\n<p>For the record, the OSR didn't influence Apocalypse World much at all, but Basic D&amp;D definitely did. (In my case, Moldvay ed, 1980.) I think of Apocalypse World and the OSR as cousins in that way, so of course they share some things and really don't share others.</p>\n</blockquote>\n<p>That's it for this (admittedly convoluted) thought! Thank you Vincent for your insight! I'll head to my corner and start working on a PbtA + OSR hybrid now...</p>",
            "author": {
                "name": "HiskiH"
            },
            "tags": [
                   "osr",
                   "feeling &amp; thought"
            ],
            "date_published": "2025-10-08T12:58:11+03:00",
            "date_modified": "2025-10-12T22:11:42+03:00"
        },
        {
            "id": "https://blog.hiskih.fi/feeling-and-thought-designers-writers-and-artists.html",
            "url": "https://blog.hiskih.fi/feeling-and-thought-designers-writers-and-artists.html",
            "title": "Feeling &amp; Thought: Designers, Writers and Artists",
            "summary": "I believe there are three types of indie RPG makers: Designers, Writers&hellip;",
            "content_html": "<p>I believe there are three types of indie RPG makers: Designers, Writers or Artists. There probably exits many more categorizations but today I will focus on these three. Despite many indie RPG makers needing to work all three of these roles, relatively few actually are experts in all of them. I believe it is useful to recognize which of these skillsets you have and which style of work you prefer.</p>\n<pre><em>This is a Feeling &amp; Thought. A series where I write about my experiences in the TTRPG hobby. Just like feelings, these thoughts aren't science, they aren't truth, and they definitely aren't reliable. Explore them with a playful attitude and don't take them too seriously. I certainly don't.</em></pre>\n<p><strong>Designers: </strong>The rules-nerds and those obsessed with dice systems. The Designer focuses on the mechanical workings of a system, totally convinced they will be the one to invent the next d20. Designers first and foremost make games over other aspects of the RPG hobby.</p>\n<p><strong>Writers: </strong>The content makers and the worldbuilders. The Writer is more than happy to pick up the reliable PbtA 2d6 to make their narrative come to life in a 400-page tome that no-one has time to read. Writers are most interested in making the roleplay part of the RPG acronym.</p>\n<p><strong>Artist: </strong>While having some overlap with the Writer, the Artist is more focused on stretching the boundaries of the hobby by making esoteric zines and publications. Their dream is to win the ENNIE for best layout with a game that cannot actually be played. Artists are most interested in using both roleplay and game as a form of artistic expression.</p>\n<p>We as RPG makers see lots of games. We like some and dislike others. A lot of it boils down to which of these three archetypes made that particular game and which archetype we find most interesting. Here's some examples all from the same small circle of OSR games:</p>\n<p><strong>Shadowdark </strong>is a Designer game. It's layout and art is simplistic black and white and the game really isn't known for it's worldbuilding. The true beauty of Shadowdark is how refined of a gameplay and user experience it is, using great design both in its systems and supportive content to bridge the gap between old-school and modern.</p>\n<p><strong>Mausritter </strong>is a Writer game. It uses the brilliant mechanics of Into the Odd to build one of if not the greatest game about tiny woodland critters. Most of Mausritter's charm is built into it's evocative tables and supportive content. People play Mausritter for the mice, not the dice.</p>\n<p><strong>Mörk Borg</strong> is an Artist game. It's mechanically sound but barely contains enough to be considered a full fledged game system. It's main draw is the incredible art and layout work by Johan Nohr. While many would find the lack of systems disappointing, Mörk Borg delivers a great grimdark experience with sheer loudness alone.</p>\n<p>That's that. Next time you find yourself puzzled by the success of a game, consider who made it and what are it's intentions. Is it trying to deliver in Design, Writing or Art? Which of these three did you expect?  Which one are you?</p>",
            "author": {
                "name": "HiskiH"
            },
            "tags": [
                   "osr",
                   "feeling &amp; thought"
            ],
            "date_published": "2025-09-28T20:38:08+03:00",
            "date_modified": "2025-09-29T12:29:07+03:00"
        },
        {
            "id": "https://blog.hiskih.fi/working-in-the-abstract.html",
            "url": "https://blog.hiskih.fi/working-in-the-abstract.html",
            "title": "Working in the abstract",
            "summary": "This week we had a task to describe the thesis process. I’ve&hellip;",
            "content_html": "<p>This week we had a task to describe the thesis process. I’ve elected to change the title from last week</p><h4 id=\"enemy-expression-in-bx-derivative-osr-tabletop-roleplaying-games\">Enemy Expression in B/X-Derivative OSR Tabletop Roleplaying Games</h4>\n<p><em>Team:</em> Solo</p><p><em>Project type:</em> Research project</p><p><em>Technology:</em> Games are books, written on Overleaf using Zotero as reference manager</p><p>The project mostly consists of reading and cataloging a series of tabletop roleplaying game rulebooks. The aim of  the study is to find families of presentation styles for enemy statistics in these games using k-means clustering. I was inspired by the methodology detailed in this post <a href=\"https://traversefantasy.blogspot.com/2022/12/osr-rules-families-faq-methodology.html?m=1\">https://traversefantasy.blogspot.com/2022/12/osr-rules-families-faq-methodology.html?m=1</a></p><p>The main dataset will be limited to any books and pdfs I can get access to. I have a good set already and many games have rules that are freely available. I can use the reference list in the post as a starting point and add in some statistics from rpg.net forum users preferred games to filter out bias.</p><p>Whether I end up with this plan or not shall be seen. I’m already thinking of using the findings from the above link as a basis and instead studying each cluster individually.</p>",
            "author": {
                "name": "HiskiH"
            },
            "tags": [
                   "thesis",
                   "osr"
            ],
            "date_published": "2025-09-22T21:09:45+03:00",
            "date_modified": "2025-09-22T21:09:45+03:00"
        },
        {
            "id": "https://blog.hiskih.fi/thesis-origins.html",
            "url": "https://blog.hiskih.fi/thesis-origins.html",
            "title": "Thesis Origins",
            "summary": "Welcome to my journey to write my Master’s thesis on tabletop roleplaying&hellip;",
            "content_html": "<p>Welcome to my journey to write my Master’s thesis on tabletop roleplaying games. There isn’t much to say at this time but I am required to start with a short summary of my intial topic, so here goes:</p><p>Enemy Balance in B/X-Derivative OSR Tabletop Roleplaying Games</p><p>OSR (old-school revival, renaissance or revolution) is a philosophical movement focused on playing and creating tabletop roleplaying games that recreate the gameplay experience of early editions of Dungeons &amp; Dragons. A core tenet of this movement is disregard for mathematical balance in enemy design which makes it difficult for new designers to create games and content for this audience. As these games are highly derivative of the original versions of Dungeons &amp; Dragons this thesis studies the similarities and differences in enemy design between these games and their original inspirations.</p><p>Let’s see how this goes</p>",
            "author": {
                "name": "HiskiH"
            },
            "tags": [
                   "thesis",
                   "osr"
            ],
            "date_published": "2025-09-22T21:07:33+03:00",
            "date_modified": "2025-09-22T21:09:51+03:00"
        }
    ]
}
