{
    "version": "https://jsonfeed.org/version/1",
    "title": "HiskiH&#x27;s Blog",
    "description": "",
    "home_page_url": "https://blog.hiskih.fi",
    "feed_url": "https://blog.hiskih.fi/feed.json",
    "user_comment": "",
    "icon": "https://blog.hiskih.fi/media/website/chess-rook.png",
    "author": {
        "name": "HiskiH"
    },
    "items": [
        {
            "id": "https://blog.hiskih.fi/new-wave-of-fantasy-nwof.html",
            "url": "https://blog.hiskih.fi/new-wave-of-fantasy-nwof.html",
            "title": "New Wave of Fantasy - NWOF",
            "summary": "Thanks to the wonderful people at the NSR Cauldron I got introduced&hellip;",
            "content_html": "<p>Thanks to the wonderful people at the NSR Cauldron I got introduced to the idea of NWOHF - New Wave of Heroic Fantasy. I was overjoyed to find a label that finally fits my Runecycle as NSR has always felt a slight mismatch. As of now I do not know exactly who coined the term but I’ll add a citation if I’m able to find it. In this post I’ll give my take on the whole thing.</p><p>So what is NWOHF? It is a label that describes heroic fantasy games that are made in response to Dungeons &amp; Dragons 5e. That is the only consistent characteristic. Another major one is that these games are usually made or at least released after the OGL fiasco.</p><p>A lot of games have been made in response to DnD 5e, so what makes this different? Ever since 5e and the original very permissible OGL have there been games that improve and iterate on the 5e formula, such as Level Up: Advanced 5th Edition or even Shadowdark. But these games either build on 5e directly or use the d20 system to make an entirely different  genre of game. The NWOHF label is specifically for games that take the overall story structure and feel of heroic fantasy 5e is famous for and deliver it using different mechanics. It’s DND but not. The NWOHF is to DnD what NSR is to the OSR. And 5e is the B/X of NWOHF. That’s the simple way of putting it.</p><p>So then, games. The following examples fit the strictest definitions of NWOHF:</p><ul>\n<li>Daggerheart</li>\n<li>Nimble</li>\n<li>DC20</li>\n<li>Draw Steel</li>\n<li>Tales of the Valiant</li>\n</ul>\n<p>There are a couple games that in my eyes skirt the definition</p><ul>\n<li>Grimwild</li>\n<li>Dragon Slayers</li>\n<li>Fabula Ultima</li>\n<li>Cosmere RPG</li>\n</ul>\n<p>I want to expand the defintion slightly by dropping the Heroic H. Not because it doesn’t  fit but because 1. the acronym is nicer without it, the H is silent and 2. to encompass slightly more games that otherwise fit the defintion. This way the games above can be included without a hitch, and the following can be added to New Wave of Fantasy:</p><ul>\n<li>Legend in the Mist - a Rustic Fantasy RPG</li>\n<li>Vagabond // Pulp Fantasy RPG</li>\n</ul>\n<p>There is even the possibility of adding Mythic Bastionland into the fold. Due to its Into the Odd roots I’d still say it is more NSR than NWOF.</p><p>Here’s the family tree. NWOF stands firmly between NSR and 5e. A brother from another mother to NSR even. The NSR builds towards NWOF from OSR and NFOW builds towards NSR from 5e. May they meet in the middle.</p><pre class=\"mermaid\">flowchart LR\n    B/X --- OSR --- NSR --- NWOF --- 5e\n</pre>\n<p>Because people like definitions I’ll end this with a concise definition for you to use.</p><p>NWOF games are:</p><ul>\n<li>always fantasy games made in response to DnD 5e</li>\n<li>usually games made after the OGL fiasco</li>\n<li>often heroic and use the familiar kitchen-sink style of DnD 5e</li>\n</ul>\n<p>Or in a single line:</p><p><em>NWOF games feel like 5e DnD narratively but not mechanically</em></p><p>That’s it for today, go argue about definitions or something!</p>",
            "author": {
                "name": "HiskiH"
            },
            "tags": [
                   "runecycle",
                   "design"
            ],
            "date_published": "2025-11-14T11:39:49+02:00",
            "date_modified": "2025-11-14T11:48:43+02:00"
        },
        {
            "id": "https://blog.hiskih.fi/runecycle-yes-and-design.html",
            "url": "https://blog.hiskih.fi/runecycle-yes-and-design.html",
            "title": "Runecycle: &quot;Yes, and&quot; Design",
            "summary": "As I am wrapping up Runecycle I find myself wanting to discuss&hellip;",
            "content_html": "<p>As I am wrapping up Runecycle I find myself wanting to discuss a phenomenon I've finally found a name for: \"Yes, and\" Design. I believe it is one corner of the neo-trad / OC / modern DnD playstyle, though curiously it seems to often have OSR influence as well.</p>\n<p>What I'm talking about is games that are designed to empower the players and GM to do cool things. And you'd think this would describe a loooot of games and you'd be right. But having written (in my mind) an explicitly <em>Yes, and</em> game, I would like to be more specific.</p>\n<p>Many playstyles give players what they want in some way or another. A good OSR referee will allow the players to use their creativity in solving an obstacle, and storygames and PbtA games hand over authorial power to players. What would be more <em>Yes, and</em> than that? But here's the catch: While an OSR game grants the players creative freedom, the genre is inherently beholden to some amount of gritty realism. There is some amount of <em>Yes, but</em> going around. Similarly, games that give authorial control to everyone aren't in my eyes <em>Yes, and</em> as they tend to give out the reigns to the players as opposed to fostering a yes-and-ing collaboration between GM and player. I feel like too much narrative freedom is just <em>Yes, yes</em> Design, as opposed to the rules-driven sandbox of <em>Yes, and</em>.</p>\n<p>So what do I mean by <em>Yes, and</em>? I mean games that have rules that</p>\n<ul>\n<li>Explicitly encourage yes-and-ing by stating to rule in favor of the players in the procedure, and while rules detailed, are written with the explicit intent of being partially ignored. Rules that are not made to be watertight simulations but instead to offer a framework of fun (such as Vagabond // Pulp Fantasy RPG). </li>\n<li>Give players freedom to create unique and personal characters. Many games (Runecycle included) take the tag approach that allows for players to describe their character in thematic words and sentences without direct limits. Vagabond skirts the line with it's perk-system and mechanics-only magic system.</li>\n<li>Encourage players and GMs to tell a good story over tightly ruled game. That the game system inherently pushes players to stretch what is realistic and the GM to take the players from 0 to 100 in the narrative whenever necessary.</li>\n</ul>\n<p>These three features I observe in my playtests of Runecycle.</p>\n<p>That players tend to create characters with powers and backgrounds no-one could have foreseen: Everything from a now extinct <em>Steller's Sea Cow </em>to the<em> literal narrator of the story</em>.</p>\n<p>How I as the GM use the various tools in the rules toolbox to choose what type of rolls and Test I ask for and when, flexing both the passage of time and how success is defined to make the play experience as fun as it can be. Runecycle in my hands builds inherently high-action stories where fun and laughter is the primary goal, without trying to be a game of comedy.</p>\n<p>And how one of the first things the book tells the reader is to take the system and run it the way you want. I've hopefully been able to make a game that is very easy to mod and extend both narratively and ruleswise, without making a modular or generic system. I want you to take the bits you like and ignore the one's you don't.</p>\n<hr>\n<p>Yes-and-ing is great! So why isn't every game like that? Well, taking <em>Yes, and</em> to an extreme can have, for example, these negative consequences:</p>\n<ul>\n<li>lack of coherence, generality over specificity</li>\n<li>leaning on GM fiat while not having well defined basis to which make rulings from</li>\n<li>inherently more whimsical and less serious than many other games</li>\n<li>somehow both overwhelming and underwhelming rules</li>\n<li>no guardrails against optimizers and people bad at co-operating</li>\n</ul>\n<p>With that said, <em>Yes, and</em> Design is not a binary metric, most games have some amount of <em>Yes, and</em> in them. So take what you like and <em>Yes, and</em> yourself! Go make some games that <em>Yes, and</em> the way you see best.</p>\n<p>Cheers!</p>",
            "author": {
                "name": "HiskiH"
            },
            "tags": [
                   "runecycle",
                   "design"
            ],
            "date_published": "2025-10-25T20:41:57+03:00",
            "date_modified": "2025-10-26T11:32:37+02:00"
        },
        {
            "id": "https://blog.hiskih.fi/dice-math-rolling-doubles-on-arbitrary-dice.html",
            "url": "https://blog.hiskih.fi/dice-math-rolling-doubles-on-arbitrary-dice.html",
            "title": "Dice Math: Rolling Doubles on Arbitrary Dice",
            "summary": "As I was finalizing the mechanics on Runecycle I needed a semi-frequent&hellip;",
            "content_html": "<p>As I was finalizing the mechanics on Runecycle I needed a semi-frequent and easy to read way to trigger an event: a way to regain resources by playing. I tried a couple different ways until I settled on my current approach: when you roll doubles. In the game you always roll two dice of varying sizes, similar to how the Year Zero Engine step-dice variant works. A lot can be said about the math in this system but that is a story for another day. Here I want to talk about rolling doubles, or in other words rolling the same number on both dice. You might notice this is how crits work in Daggerheart too. Topical, huh.</p><p>This isn’t something new, this probability has been known for a loooong time. But I wager many don’t know about it especially considering how little the mechanic is used in ttrpgs.</p><p>The probability of rolling the same number on two arbitrarily sized dice is</p><pre class=\"mermaid\">graph LR \n    A[&quot;$$\\frac{x}{all}$$&quot;]\n</pre>\n<p>where x is the number of desired outcomes (dice with same value) and all is every possible outcome.</p><p>We know that the number of all outcomes is die size 1 x die size 2. Every combination of both dice. For desired outcomes if both dice are the same size this is easy as we can just take each pair. For 2d6 that would be (1,1), (2,2), (3,3), (4,4), (5,5) and (6,6). Total of 6 desired outcomes.</p><p>But if the dice are arbitrarily sized? That’s surprisingly easy as well. Since the larger of the two dice can never make a pair with numbers that are higher than the possible value of the smaller die, the total possible amount of desired outcomes is still the size of the smaller die, same as with a pair of same sized dice, right? So that leaves us with the following formula:</p><pre class=\"mermaid\">graph LR \n    A[&quot;$$\\frac{smaller die}{smaller die * larger die} = \\frac{1}{larger die}$$&quot;]\n</pre>\n<p>In other words the probability of rolling doubles on two arbitrary dice is 1 divided by the size of the larger die. Crazy and convinient. It’s the same as rolling the smaller die to determine which number needs to be rolled and then rolling the bigger die. The probability of rolling any one number on the bigger die is of course 1 / (die size).</p><p>Now comes the fun part. List all of the probabilities based on the larger die for d4 to d20:</p><table>\n<thead>\n<tr>\n<th>d4</th>\n<th>d6</th>\n<th>d8</th>\n<th>d10</th>\n<th>d12</th>\n<th>d20</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>25%</td>\n<td>16.67%</td>\n<td>12.5%</td>\n<td>10%</td>\n<td>8.34%</td>\n<td>5%</td>\n</tr>\n</tbody></table>\n<p>As you can see, whatever pair of dice you roll, you know the probability of rolling doubles. And assuming you are using a pair between d6 and d12, you know the probability is approximately 10-15%. If larger die is better a player might work it out that your chance of rolling doubles is twice as low for a pair that has a d12 than it is for 2d6. But if succeeding with 2d6 is way less likely than say d12+d6 then no-one is willing to take that bet for a 16% chance to roll doubles, when the alternative is a high probability to succeed and 8% chance to roll doubles. Especially in my game where rolling doubles does not make you succeed at the roll like Daggerheart does.</p><p>That’s it for today! Go make cool stuff now.</p>",
            "author": {
                "name": "HiskiH"
            },
            "tags": [
                   "runecycle",
                   "math",
                   "design"
            ],
            "date_published": "2025-10-23T18:13:19+03:00",
            "date_modified": "2025-10-26T11:33:30+02:00"
        },
        {
            "id": "https://blog.hiskih.fi/feeling-and-thought-osr-procedures-are-pbta-moves.html",
            "url": "https://blog.hiskih.fi/feeling-and-thought-osr-procedures-are-pbta-moves.html",
            "title": "Feeling &amp; Thought: OSR procedures are PbtA moves?",
            "summary": "You read the title. After doing some heavy research into various OSR&hellip;",
            "content_html": "<p>You read the title. After doing some heavy research into various OSR games as well as reading both Apocalypse World and Masks: A New Generation I had a thought: how far are OSR procedures from PbtA moves?</p>\n<pre><em>This is a Feeling &amp; Thought. A series where I write about my experiences in the TTRPG hobby. Just like feelings, these thoughts aren't science, they aren't truth, and they definitely aren't reliable. Explore them with a playful attitude and don't take them too seriously. I certainly don't.<br></em></pre>\n<p>Credit where credit is due, this whole thought is based on discussion we had over at the NSR Cauldron. Prompted by a question of transitioning from PbtA games to OSR games, a debate was held on the similarities of these two playstyles. Of course these two styles differ in their approach to story: PbtA maximizing the narrative impact and flow whereas OSR almost nihilistically disregards storytelling. The priorities at the table could not be more diametrically opposed. Yet, when looking at the tools these games use, they suddenly are not that far apart.</p>\n<h5>Minimal Rules</h5>\n<p>Both styles aim to be extremely simple to run and reduce the amount of rules a player needs to remember.</p>\n<h5>Roll when necessary</h5>\n<p>Both styles are very particular about when to roll dice. OSR to resolve conflict and PbtA to resolve a situation when a move is triggered.</p>\n<h5>Proceduralism</h5>\n<p>While the more minimal OSR games avoid heavy procedure, more recent games like Errant are quite thick with various systems to keep the game running. PbtA games are quite similar with extensive and complex move descriptions with elaborate outcomes.</p>\n<p>A big point of contention in the discussion was about the idea of looking for solutions on your character sheet. This is a gameplay ideal OSR often uses to differentiate itself from modern D&amp;D and its ilk: OSR games want you to solve problems in fiction, wheras games with more elaborate character sheets and abilities often result in players looking for spells and abilities from their character. Initially I argued using the points mentioned above that PbtA runs similar to OSR, with a series of moves that explain the procedure for particular actions. However...</p>\n<hr>\n<p>Vincent Baker, the author of Apocalypse World, the A in PbtA, appeared carrying great insight! Which did sway me to change my view slightly. The following are a few quotes from Vincent, posted with permission, and my thoughts on them:</p>\n<blockquote>\n<p>If you think of AW as kind of a contract between the players (inc the GM), the moves are things that the players are entitled to. When I have my character read a situation, for instance, I'm entitled to roll+Sharp and ask a couple of questions.</p>\n</blockquote>\n<p>Very clearly the players are expected to use the tools in their arsenal. Obviously OSR games also grant you tools to use but not at this scale. Push-button-on-sheet confirmed?</p>\n<blockquote>\n<p>I don't think of them [moves] as solutions, in Apocalypse World's case. Many of the moves, most of the time, don't solve problems, they clarify and/or escalate them.</p>\n</blockquote>\n<p>This is where it gets interesting. The main issue OSR players have with the modern D&amp;D style is that quite often players will see a problem and ask to make something like an <em>Intelligence Check </em>to get a solution or cast a spell (that can't fail by the way) to make something happen. The moves in Apocalypse World don't exactly work this way, instead they direct the flow of action towards an outcome. Vincent wrapped up this line of thought nicely:</p>\n<blockquote>\n<p>If the GM's job is to give you problems, then yeah, sometimes your moves will give you solutions to them, and that can be pretty dissatisfying. But if the GM's job is to give you interesting situations to make decisions about, you'll never find your decision in your moves, your moves just give you different options to consider. This is Apocalypse World's model. I can't speak for other PbtA games!</p>\n</blockquote>\n<hr>\n<p>Where does this lead? Obviously the styles of play are different, but how exactly? My aswer is this: Both OSR and PbtA style games can be procedure heavy, but where PbtA wants you to use its procedure (moves) actively, OSR games use procedures to speed players along to the point, which is problem solving in fiction. Even a procedure heavy OSR game doesn't want you to play through procedure unless necessary. For PbtA the moves are the gameplay.</p>\n<p>Another question I pondered is how much the problems these styles of play present  influences the amount of procedure used. If a character from Apocalypse World entered an OSR style dungeon I think they would not use most of their moves to solve their problems. The majority of moves are to direct stories between characters, as opposed to characters and their environment. If social situations were more prevalent in OSR games, would we have more active procedures to resolve them?</p>\n<p>So all in all, to no-one's surprise, the games and styles share some common dna but have major differences. Vincent confirmed this as well:</p>\n<blockquote>\n<p>For the record, the OSR didn't influence Apocalypse World much at all, but Basic D&amp;D definitely did. (In my case, Moldvay ed, 1980.) I think of Apocalypse World and the OSR as cousins in that way, so of course they share some things and really don't share others.</p>\n</blockquote>\n<p>That's it for this (admittedly convoluted) thought! Thank you Vincent for your insight! I'll head to my corner and start working on a PbtA + OSR hybrid now...</p>",
            "author": {
                "name": "HiskiH"
            },
            "tags": [
                   "osr",
                   "feeling &amp; thought",
                   "design"
            ],
            "date_published": "2025-10-08T12:58:11+03:00",
            "date_modified": "2025-10-26T11:32:59+02:00"
        },
        {
            "id": "https://blog.hiskih.fi/feeling-and-thought-designers-writers-and-artists.html",
            "url": "https://blog.hiskih.fi/feeling-and-thought-designers-writers-and-artists.html",
            "title": "Feeling &amp; Thought: Designers, Writers and Artists",
            "summary": "I believe there are three types of indie RPG makers: Designers, Writers&hellip;",
            "content_html": "<p>I believe there are three types of indie RPG makers: Designers, Writers or Artists. There probably exits many more categorizations but today I will focus on these three. Despite many indie RPG makers needing to work all three of these roles, relatively few actually are experts in all of them. I believe it is useful to recognize which of these skillsets you have and which style of work you prefer.</p>\n<pre><em>This is a Feeling &amp; Thought. A series where I write about my experiences in the TTRPG hobby. Just like feelings, these thoughts aren't science, they aren't truth, and they definitely aren't reliable. Explore them with a playful attitude and don't take them too seriously. I certainly don't.</em></pre>\n<p><strong>Designers: </strong>The rules-nerds and those obsessed with dice systems. The Designer focuses on the mechanical workings of a system, totally convinced they will be the one to invent the next d20. Designers first and foremost make games over other aspects of the RPG hobby.</p>\n<p><strong>Writers: </strong>The content makers and the worldbuilders. The Writer is more than happy to pick up the reliable PbtA 2d6 to make their narrative come to life in a 400-page tome that no-one has time to read. Writers are most interested in making the roleplay part of the RPG acronym.</p>\n<p><strong>Artist: </strong>While having some overlap with the Writer, the Artist is more focused on stretching the boundaries of the hobby by making esoteric zines and publications. Their dream is to win the ENNIE for best layout with a game that cannot actually be played. Artists are most interested in using both roleplay and game as a form of artistic expression.</p>\n<p>We as RPG makers see lots of games. We like some and dislike others. A lot of it boils down to which of these three archetypes made that particular game and which archetype we find most interesting. Here's some examples all from the same small circle of OSR games:</p>\n<p><strong>Shadowdark </strong>is a Designer game. It's layout and art is simplistic black and white and the game really isn't known for it's worldbuilding. The true beauty of Shadowdark is how refined of a gameplay and user experience it is, using great design both in its systems and supportive content to bridge the gap between old-school and modern.</p>\n<p><strong>Mausritter </strong>is a Writer game. It uses the brilliant mechanics of Into the Odd to build one of if not the greatest game about tiny woodland critters. Most of Mausritter's charm is built into it's evocative tables and supportive content. People play Mausritter for the mice, not the dice.</p>\n<p><strong>Mörk Borg</strong> is an Artist game. It's mechanically sound but barely contains enough to be considered a full fledged game system. It's main draw is the incredible art and layout work by Johan Nohr. While many would find the lack of systems disappointing, Mörk Borg delivers a great grimdark experience with sheer loudness alone.</p>\n<p>That's that. Next time you find yourself puzzled by the success of a game, consider who made it and what are it's intentions. Is it trying to deliver in Design, Writing or Art? Which of these three did you expect?  Which one are you?</p>",
            "author": {
                "name": "HiskiH"
            },
            "tags": [
                   "osr",
                   "feeling &amp; thought"
            ],
            "date_published": "2025-09-28T20:38:08+03:00",
            "date_modified": "2025-09-29T12:29:07+03:00"
        },
        {
            "id": "https://blog.hiskih.fi/working-in-the-abstract.html",
            "url": "https://blog.hiskih.fi/working-in-the-abstract.html",
            "title": "Working in the abstract",
            "summary": "This week we had a task to describe the thesis process. I’ve&hellip;",
            "content_html": "<p>This week we had a task to describe the thesis process. I’ve elected to change the title from last week</p><h4 id=\"enemy-expression-in-bx-derivative-osr-tabletop-roleplaying-games\">Enemy Expression in B/X-Derivative OSR Tabletop Roleplaying Games</h4>\n<p><em>Team:</em> Solo</p><p><em>Project type:</em> Research project</p><p><em>Technology:</em> Games are books, written on Overleaf using Zotero as reference manager</p><p>The project mostly consists of reading and cataloging a series of tabletop roleplaying game rulebooks. The aim of  the study is to find families of presentation styles for enemy statistics in these games using k-means clustering. I was inspired by the methodology detailed in this post <a href=\"https://traversefantasy.blogspot.com/2022/12/osr-rules-families-faq-methodology.html?m=1\">https://traversefantasy.blogspot.com/2022/12/osr-rules-families-faq-methodology.html?m=1</a></p><p>The main dataset will be limited to any books and pdfs I can get access to. I have a good set already and many games have rules that are freely available. I can use the reference list in the post as a starting point and add in some statistics from rpg.net forum users preferred games to filter out bias.</p><p>Whether I end up with this plan or not shall be seen. I’m already thinking of using the findings from the above link as a basis and instead studying each cluster individually.</p>",
            "author": {
                "name": "HiskiH"
            },
            "tags": [
                   "thesis",
                   "osr"
            ],
            "date_published": "2025-09-22T21:09:45+03:00",
            "date_modified": "2025-09-22T21:09:45+03:00"
        },
        {
            "id": "https://blog.hiskih.fi/thesis-origins.html",
            "url": "https://blog.hiskih.fi/thesis-origins.html",
            "title": "Thesis Origins",
            "summary": "Welcome to my journey to write my Master’s thesis on tabletop roleplaying&hellip;",
            "content_html": "<p>Welcome to my journey to write my Master’s thesis on tabletop roleplaying games. There isn’t much to say at this time but I am required to start with a short summary of my intial topic, so here goes:</p><p>Enemy Balance in B/X-Derivative OSR Tabletop Roleplaying Games</p><p>OSR (old-school revival, renaissance or revolution) is a philosophical movement focused on playing and creating tabletop roleplaying games that recreate the gameplay experience of early editions of Dungeons &amp; Dragons. A core tenet of this movement is disregard for mathematical balance in enemy design which makes it difficult for new designers to create games and content for this audience. As these games are highly derivative of the original versions of Dungeons &amp; Dragons this thesis studies the similarities and differences in enemy design between these games and their original inspirations.</p><p>Let’s see how this goes</p>",
            "author": {
                "name": "HiskiH"
            },
            "tags": [
                   "thesis",
                   "osr"
            ],
            "date_published": "2025-09-22T21:07:33+03:00",
            "date_modified": "2025-09-22T21:09:51+03:00"
        }
    ]
}
